#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.fourkeys.module.gcloud_build_batch_events_bq_writer.data.external.env_override[0]: Reading...
module.fourkeys.module.test_artifact_registry_url_demo.data.external.env_override[0]: Reading...
module.fourkeys.data.archive_file.events_bq_writer_source: Reading...
module.fourkeys.data.archive_file.batch_gh_audit_log_source: Reading...
module.fourkeys.module.test_artifact_registry_url_demo.data.external.env_override[0]: Read complete after 0s [id=-]
module.fourkeys.data.archive_file.events_bq_writer_source: Read complete after 0s [id=6f2d6c347b7f4e8eba5d12946eda38b1d84b2af7]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.data.external.env_override[0]: Read complete after 0s [id=-]
module.fourkeys.data.archive_file.demo: Reading...
module.fourkeys.module.gcloud_build_batch_events_bq_writer.null_resource.run_destroy_command[0]: Refreshing state... [id=7501264970071068882]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.null_resource.run_command[0]: Refreshing state... [id=2671861280509006243]
module.fourkeys.data.archive_file.demo: Read complete after 0s [id=27048e1c90c9d32b3b7f85e566577434ee8089dc]
module.fourkeys.data.archive_file.batch_gh_audit_log_source: Read complete after 0s [id=1611b57785891d90c948aee9fdc75df186364375]
module.fourkeys.module.test_artifact_registry_url_demo.null_resource.run_destroy_command[0]: Refreshing state... [id=1073344346946287230]
module.fourkeys.module.test_artifact_registry_url_demo.null_resource.run_command[0]: Refreshing state... [id=6910234484688625973]
module.fourkeys.google_storage_bucket_iam_member.source_bucket_access_logs: Refreshing state... [id=b/off-net-dev-gh-audit-log-station-local/roles/storage.admin/serviceAccount:project-541105984323@storage-transfer-service.iam.gserviceaccount.com]
module.fourkeys.google_storage_bucket.gh_audit_log_archieve_local: Refreshing state... [id=off-net-dev-gh-audit-log-archieve-local]
module.fourkeys.data.google_storage_transfer_project_service_account.logs: Reading...
module.fourkeys.google_storage_bucket.events_station_local: Refreshing state... [id=off-net-dev-events-station-local]
module.fourkeys.google_storage_bucket.events_archieve_local: Refreshing state... [id=off-net-dev-events-archieve-local]
module.fourkeys.data.google_storage_bucket.gh_audit_log_archieve_local: Reading...
module.fourkeys.google_bigquery_dataset.dataset: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys]
module.fourkeys.data.google_project.project: Reading...
module.fourkeys.google_storage_bucket.batch_gh_log_function_bucket: Refreshing state... [id=off-net-dev-batch-gh-log-function]
module.fourkeys.google_cloud_run_service.batch_events_bq_writer: Refreshing state... [id=locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-events-bq-writer]
module.fourkeys.data.google_storage_transfer_project_service_account.logs: Read complete after 1s [id=project-541105984323@storage-transfer-service.iam.gserviceaccount.com]
module.fourkeys.google_storage_bucket.gh_audit_log_station_local: Refreshing state... [id=off-net-dev-gh-audit-log-station-local]
module.fourkeys.google_storage_bucket_iam_member.destination_bucket_access_logs: Refreshing state... [id=b/off-net-dev-gh-audit-log-archieve-local/roles/storage.admin/serviceAccount:project-541105984323@storage-transfer-service.iam.gserviceaccount.com]
module.fourkeys.data.google_storage_bucket.gh_audit_log_archieve_local: Read complete after 1s [id=off-net-dev-gh-audit-log-archieve-local]
module.fourkeys.data.google_storage_bucket.gh_audit_log_station_local: Reading...
module.fourkeys.google_cloud_run_service.batch_logs_bq_writer_demo: Refreshing state... [id=locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-logs-bq-writer-demo]
module.fourkeys.google_storage_bucket_object.batch_gh_audit_log_zip: Refreshing state... [id=off-net-dev-batch-gh-log-function-src-acff784e1bfabb2e0496dc23b2935b13.zip]
module.fourkeys.google_bigquery_table.batch_events: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys/tables/batch_events]
module.fourkeys.google_bigquery_table.batch_logs: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys/tables/batch_logs]
module.fourkeys.google_eventarc_trigger.primary: Refreshing state... [id=projects/off-net-dev/locations/northamerica-northeast1/triggers/name]
module.fourkeys.data.google_project.project: Read complete after 1s [id=projects/off-net-dev]
module.fourkeys.google_storage_transfer_job.batch_logs_transfer_job: Refreshing state... [id=off-net-dev/2870788994826366552]
module.fourkeys.data.google_storage_bucket.gh_audit_log_station_local: Read complete after 0s [id=off-net-dev-gh-audit-log-station-local]
module.fourkeys.google_cloudfunctions2_function.batch_gh_audit_log_function: Refreshing state... [id=projects/off-net-dev/locations/northamerica-northeast1/functions/batch_gh_audit_log]
module.fourkeys.google_eventarc_trigger.gh_logs_trigger_demo: Refreshing state... [id=projects/off-net-dev/locations/northamerica-northeast1/triggers/gh-logs-trigger-demo]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.fourkeys.google_cloud_run_service.batch_events_bq_writer will be updated in-place
  ~ resource "google_cloud_run_service" "batch_events_bq_writer" {
        id                         = "locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-events-bq-writer"
        name                       = "batch-events-bq-writer"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                    # (3 unchanged attributes hidden)

                  ~ resources {
                      ~ limits   = {
                          - "cpu"    = "1000m" -> null
                            # (1 unchanged element hidden)
                        }
                        # (1 unchanged attribute hidden)
                    }

                    # (3 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fourkeys.google_cloud_run_service.batch_logs_bq_writer_demo will be updated in-place
  ~ resource "google_cloud_run_service" "batch_logs_bq_writer_demo" {
        id                         = "locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-logs-bq-writer-demo"
        name                       = "batch-logs-bq-writer-demo"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ metadata {
              ~ annotations = {
                  ~ "client.knative.dev/user-image"    = "northamerica-northeast1-docker.pkg.dev/off-net-dev/gcf-artifacts/off-net-dev/logs-by-artifact:6c1bb5ba27bd83aabb22cffba9470a9ca91073b6" -> "northamerica-northeast1-docker.pkg.dev/off-net-dev/gcf-artifacts/off-net-dev/logs-by-artifact:27048e1c90c9d32b3b7f85e566577434ee8089dc"
                    # (3 unchanged elements hidden)
                }
                # (2 unchanged attributes hidden)
            }
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "northamerica-northeast1-docker.pkg.dev/off-net-dev/gcf-artifacts/off-net-dev/logs-by-artifact:6c1bb5ba27bd83aabb22cffba9470a9ca91073b6" -> "northamerica-northeast1-docker.pkg.dev/off-net-dev/gcf-artifacts/off-net-dev/logs-by-artifact:27048e1c90c9d32b3b7f85e566577434ee8089dc"
                    # (2 unchanged attributes hidden)

                  ~ resources {
                      ~ limits   = {
                          - "cpu"    = "1000m" -> null
                            # (1 unchanged element hidden)
                        }
                        # (1 unchanged attribute hidden)
                    }

                    # (3 unchanged blocks hidden)
                }
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.fourkeys.google_cloudfunctions2_function.batch_gh_audit_log_function is tainted, so must be replaced
-/+ resource "google_cloudfunctions2_function" "batch_gh_audit_log_function" {
      ~ effective_labels = {} -> (known after apply)
      ~ environment      = "GEN_2" -> (known after apply)
      ~ id               = "projects/off-net-dev/locations/northamerica-northeast1/functions/batch_gh_audit_log" -> (known after apply)
      - labels           = {} -> null
        name             = "batch_gh_audit_log"
      ~ state            = "FAILED" -> (known after apply)
      ~ terraform_labels = {} -> (known after apply)
      ~ update_time      = "2024-02-26T20:48:40.531647766Z" -> (known after apply)
      ~ url              = "https://northamerica-northeast1-off-net-dev.cloudfunctions.net/batch_gh_audit_log" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ build_config {
          ~ build                 = "projects/541105984323/locations/northamerica-northeast1/builds/f18737ff-d2b6-4eb2-ac8f-5dbb207c42ba" -> (known after apply)
          - docker_repository     = "projects/off-net-dev/locations/northamerica-northeast1/repositories/gcf-artifacts" -> null
          ~ environment_variables = {} -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ generation = 1708980455114947 -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }
        }

      + event_trigger {
          + event_type            = "google.cloud.storage.object.v1.finalized"
          + pubsub_topic          = (known after apply)
          + retry_policy          = "RETRY_POLICY_RETRY"
          + service_account_email = "dora-wif@off-net-dev.iam.gserviceaccount.com"
          + trigger               = (known after apply)
          + trigger_region        = "northamerica-northeast1"

          + event_filters {
              + attribute = "bucket"
              + value     = "gh-audit-log-bucket"
            }
        }

      + service_config {
          + all_traffic_on_latest_revision   = true
          + available_cpu                    = (known after apply)
          + available_memory                 = "1024M"
          + gcf_uri                          = (known after apply)
          + ingress_settings                 = "ALLOW_INTERNAL_ONLY"
          + max_instance_count               = 3000
          + max_instance_request_concurrency = (known after apply)
          + min_instance_count               = 0
          + service                          = (known after apply)
          + service_account_email            = "dora-wif@off-net-dev.iam.gserviceaccount.com"
          + timeout_seconds                  = (known after apply)
          + uri                              = (known after apply)
        }
    }

  # module.fourkeys.module.test_artifact_registry_url_demo.null_resource.run_command[0] must be replaced
-/+ resource "null_resource" "run_command" {
      ~ id       = "6910234484688625973" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "arguments"             = "f9b5650f5681d404bbce3133a4eaf26a" -> "e4c9fed7834a623cb1e1427944387d72"
          ~ "create_cmd_body"       = "builds submit ../batch_logs --tag=northamerica-northeast1-docker.pkg.dev/off-net-dev/gcf-artifacts/off-net-dev/logs-by-artifact:6c1bb5ba27bd83aabb22cffba9470a9ca91073b6 --project=off-net-dev --gcs-log-dir=gs://tf-cloud-build-gh-logs" -> "builds submit ../batch_logs --tag=northamerica-northeast1-docker.pkg.dev/off-net-dev/gcf-artifacts/off-net-dev/logs-by-artifact:27048e1c90c9d32b3b7f85e566577434ee8089dc --project=off-net-dev --gcs-log-dir=gs://tf-cloud-build-gh-logs"
            # (3 unchanged elements hidden)
        }
    }

  # module.fourkeys.module.test_artifact_registry_url_demo.null_resource.run_destroy_command[0] must be replaced
-/+ resource "null_resource" "run_destroy_command" {
      ~ id       = "1073344346946287230" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "destroy_cmd_body"       = "container images delete northamerica-northeast1-docker.pkg.dev/off-net-dev/gcf-artifacts/off-net-dev/logs-by-artifact:6c1bb5ba27bd83aabb22cffba9470a9ca91073b6 --quiet" -> "container images delete northamerica-northeast1-docker.pkg.dev/off-net-dev/gcf-artifacts/off-net-dev/logs-by-artifact:27048e1c90c9d32b3b7f85e566577434ee8089dc --quiet"
            # (2 unchanged elements hidden)
        }
    }

Plan: 3 to add, 2 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @lendly-telus-com, Action: `pull_request`*